Show / Hide Table of Contents
Class LineSupport
Line support
Inheritance
System.Object
OpenObject
OpenElementId
LineSupport
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Detail
Assembly: IdeaRS.OpenModel.dll
Syntax
public class LineSupport : OpenElementId
Constructors
Improve this Doc   View Source
LineSupport()
constructor
Declaration
public LineSupport()
Properties
Improve this Doc   View Source
Direction
local / global
Declaration
public LoadDirection Direction { get; set; }
Property Value
 Type |  Description
 LoadDirection
Improve this Doc   View Source
EdgePositionType
edge position type
Declaration
public EdgeOrientationType EdgePositionType { get; set; }
Property Value
 Type |  Description
 EdgeOrientationType
Improve this Doc   View Source
GeneralLine
general shape
Declaration
public PolyLine2D GeneralLine { get; set; }
Property Value
 Type |  Description
 PolyLine2D
Improve this Doc   View Source
GeometryPointsPath
list of line load points
Declaration
public Polygon2D GeometryPointsPath { get; set; }
Property Value
 Type |  Description
 Polygon2D
Improve this Doc   View Source
GeomId
Id representing geometrical parts of Detail
Declaration
public int GeomId { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
IsPressureOnlyY
pressure only for Y
Declaration
public bool IsPressureOnlyY { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
IsUserStiffnessX
true for user stiffness
Declaration
public bool IsUserStiffnessX { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
IsUserStiffnessY
true for user stiffness
Declaration
public bool IsUserStiffnessY { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
MasterComponent
Gets or sets the master component
Declaration
public ReferenceElement MasterComponent { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
MasterEdge
master component edge
Declaration
public int MasterEdge { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Name
Gets or set the name
Declaration
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
OnWallEdge
true to add line support on wall edge
Declaration
public bool OnWallEdge { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
PositionOnEdge
position od edge
Declaration
public double PositionOnEdge { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Rz
rotation Rz
Declaration
public bool Rz { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
StiffnessRz
support stiffness Rz
Declaration
public double StiffnessRz { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
StiffnessX
support stiffness X
Declaration
public double StiffnessX { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
StiffnessY
support stiffness Y
Declaration
public double StiffnessY { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
SupportLength
support lengtj
Declaration
public double SupportLength { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
TypeEdgePosition
edge position type
Declaration
public TypeEdgePosition TypeEdgePosition { get; set; }
Property Value
 Type |  Description
 TypeEdgePosition
Improve this Doc   View Source
X
displacement in X
Declaration
public bool X { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
Y
displacement in Y
Declaration
public bool Y { get; set; }
Property Value
 Type |  Description
 System.Boolean
 Improve this Doc
 View Source